// Generic Button Titles

// UI guidelines state that "Yes" and "No" should not be used in dialogs. So don't use them.
// "YES" = "Yes";
// "NO" = "No";

OK          = "OK";
OK_REPLY    = "OK";     // Use this to avoid ambiguity when localization is missing.
CANCEL      = "Cancel";
CONTINUE    = "Continue";
DONE        = "Done";

/* Photo Stream account Setup */
PHOTO_STREAM_SETUP_ALERT_TITLE = "Photo Stream";
PHOTO_STREAM_SETUP_ALERT_MESSAGE = "With Photo Stream, your photos are automatically available on all your iCloud devices. You can turn on Photo Stream in Settings.";
PHOTO_STREAM_SETUP_LATER_BUTTON_TITLE = "Later";
PHOTO_STREAM_SETUP_SETTINGS_BUTTON_TITLE = "Settings";


/* Repeat pref */
"REPEAT" = "Repeat";

/* Shuffle pref */
"SHUFFLE" = "Shuffle";

/* Albums list title */
"ALBUMS" = "Albums";

/* Tab titles */
"ALBUMS_TAB" = "Albums";
"EVENTS_TAB" = "Events";
"FACES_TAB"  = "Faces";
"PLACES_TAB"  = "Places";
"IMPORT_TAB" = "Import";

/* Format for album image count */
"ALBUM_IMAGE_COUNT_FORMAT" = "%@ Photos";
"ALBUM_VIDEO_COUNT_FORMAT" = "%@ Videos";
"ALBUM_OTHER_COUNT_FORMAT" = "%@ Items";

"1_ALBUM_IMAGE" = "1 Photo";
"1_ALBUM_VIDEO" = "1 Video";
"1_ALBUM_OTHER" = "1 Item";
"ALBUM_ITEMS_COUNT_FORMAT" = "%@, %@";

ALBUM_THREE_TYPES_LABEL_COMMAS  = "%@, %@, %@";
ALBUM_TWO_TYPES_LABEL_COMMAS    = "%@, %@";
ALBUM_THREE_TYPES_LABEL_CONJUNCTION  = "%@, %@ and %@";
ALBUM_TWO_TYPES_LABEL_CONJUNCTION    = "%@ and %@";
ALBUM_ZERO_TYPES_LABEL   = "No Items";         // Not displayed in normal conditions.

/* Message prompting whether to display slideshow on TV or not */
"DISPLAY_ON_TV" = "Display on TV?";

/* Text for graphic displayed in content area when a video is being played on an external display */
"TVOUT_PLACEHOLDER_TITLE"    = "TV Connected";
"TVOUT_PLACEHOLDER_SUBTITLE" = "This video is playing on the TV.";

/* Format string for scrub overlay */
"PHOTO_TITLE_FORMAT" = "%1$@ of %2$@";

/* Format string for number of images remaining in camera */
"PICTURES_REMAINING_FORMAT" = "%d Remaining";

/* Setting for no music */
"Off" = "Off";

/* Setting for no music */
"NowPlaying" = "Now Playing";

/* Setting for playing whatever iPhoto set */
"FromIPhoto" = "From iPhoto";

/* Title for contact photo selection */
"CONTACT_PHOTO_TITLE_FORMAT" = "This is what it will look like when “%@” calls.";

/* Capturing HUD */
"CAPTURING" = "Capturing";

/* Retake button in crop overlay */
"RETAKE" = "Retake";

/* Use (Done) button in crop overlay */
"USE" = "Use";

/* Subtitle for contact photo selection */
"CONTACT_PHOTO_SUBTITLE" = "Move and Scale";

/* Title for cropping photo selection */
"CROP_OVERLAY_TITLE" = "Move and Scale";

/* Title for cropping wallpaper selection */
"WALLPAPER_OVERLAY_TITLE" = "Move and Scale";

/* Title for cropping photo selection */
"CROP_OVERLAY_SUBTITLE" = "";

/* Title for non-editing photo selection */
"PREVIEW" = "Preview";

/* Title for wallpaper photo selection */
"WALLPAPER_PHOTO_TITLE" = "Wallpaper Preview";

/* Title of button to set contact photo */
"SET_PHOTO_BUTTON" = "Set Photo";

"CHOOSE_PHOTO_BUTTON" = "Choose";

"USE_PHOTO_BUTTON" = "Use Photo";

/* Title of button to set wallpaper */
"SET_WALLPAPER_BUTTON" = "Set";

/*** Sharing and Action Button Labels ***/
// a. Displayed in the Action popup menu in photo view.
// b. Displayed in the Share popup menu in album view on iPhone.

SEND_VIA_EMAIL_BUTTON       = "Email";
    // Note: Generic case used in the Share menu in the album view on iPhone.

SEND_PHOTO_VIA_EMAIL_BUTTON = "Email Photo";
SEND_VIDEO_VIA_EMAIL_BUTTON = "Email Video";

TEXT_MESSAGE                = "Message";

SEND_TO_MOBILE_ME           = "Send to MobileMe";
SEND_TO_YOUTUBE             = "Send to YouTube";
TWEET                       = "Tweet";

ASSIGN_TO_CONTACT_BUTTON    = "Assign to Contact";
USE_AS_SCREENSAVER_BUTTON   = "Use as Wallpaper";
ROTATE_PHOTO                = "Rotate Photo";

COPY_PHOTO_ACTION           = "Copy Photo";
COPY_VIDEO_ACTION           = "Copy Video";
PRINT                       = "Print";


/*** ***/

/* Title of button to set screensaver */
"SET_SCREENSAVER_BUTTON" = "Set Wallpaper";

/* Status shown while setting wallpaper */
"SETTING_WALLPAPER" = "Setting Wallpaper";

/* Strings for lack of Mail setup */
"NO_EMAIL_TITLE" = "Email Account";

"NO_EMAIL_ACCOUNT_FOR_PHOTOS_OR_VIDEOS" = "To email photos or videos, set up mail account.";
"NO_EMAIL_ACCOUNT_FOR_PHOTOS" = "To email photos, set up mail account.";
"NO_EMAIL_ACCOUNT_FOR_VIDEOS" = "To email videos, set up mail account.";

/* Button tile for lack of Mail setup */
"SET_UP_MAIL_ACCOUNT" = "Set Up";

/* Status shown while saving video */
"SAVING_VIDEO" = "Saving Video";

/* Status shown while saving picture */
"SAVING_PHOTO" = "Saving Photo";

/* Status shown while loading picture */
"LOADING_PHOTO" = "Loading…";

/* Label under spinner while camera loads */
"CAMERA_LOADING" = "Loading…";

/* EXIF TIFF Model */
"TIFFMAKE" = "Apple";

/* EXIF TIFF Make */
"TIFFMODEL_IPHONE" = "iPhone";
"TIFFMODEL_IPOD" = "iPod";

/* Title shown for empty photo album - photo mode */
"NO_PHOTOS" = "No Photos";

/* Title shown for empty photo album - video mode */
"NO_VIDEOS" = "No Videos";

/* Title shown for empty photo album - both */
"NO_PHOTOS_VIDEOS" = "No Photos or Videos";

/* Title for empty camera album - */
"CAMERA_ROLL_LOCKED_iPhone" = "Your iPhone is locked.";
"CAMERA_ROLL_LOCKED_iPod touch" = "Your iPod is locked.";
"CAMERA_ROLL_LOCKED_iPad" = "Your iPad is locked.";
"CAMERA_ROLL_LOCKED_iPhone Simulator" = "Your iPhone is locked.";
"CAMERA_ROLL_LOCKED_iPad Simulator" = "Your iPad is locked.";

/* Message for empty camera album - photo mode */
"EMPTY_CAMERA_ROLL_PHOTOS" = "You can take photos using the camera.";

/* Message for empty camera album - video mode */
"EMPTY_CAMERA_ROLL_VIDEOS" = "You can take videos using the camera.";

/* Message for empty camera album - both */
"EMPTY_CAMERA_ROLL_ALL" = "You can take photos or videos using the camera.";

/* Message for empty lock screen camera album */
"EMPTY_CAMERA_ROLL_LOCKED_MESSAGE_iPhone" = "Unlock your iPhone to see all your photos and videos.";
"EMPTY_CAMERA_ROLL_LOCKED_MESSAGE_iPod touch" = "Unlock your iPod to see all your photos and videos.";
"EMPTY_CAMERA_ROLL_LOCKED_MESSAGE_iPad" = "Unlock your iPad to see all your photos and videos.";
"EMPTY_CAMERA_ROLL_LOCKED_MESSAGE_iPhone Simulator" = "Unlock your iPhone to see all your photos and videos.";
"EMPTY_CAMERA_ROLL_LOCKED_MESSAGE_iPad Simulator" = "Unlock your iPad to see all your photos and videos.";

/* Message for empty photo album */
"EMPTY_ALBUM_CAMERA_NOT_AVAILABLE_iPhone" = "You can sync photos and videos onto your iPhone using iTunes, or add photos and videos from other albums and events.";
"EMPTY_ALBUM_CAMERA_NOT_AVAILABLE_iPod touch" = "You can sync photos and videos onto your iPod using iTunes, or add photos and videos from other albums and events.";
"EMPTY_ALBUM_CAMERA_NOT_AVAILABLE_iPad" = "You can sync photos and videos onto your iPad using iTunes, or add photos and videos from other albums and events.";
"EMPTY_ALBUM_CAMERA_NOT_AVAILABLE_iPhone Simulator" = "You can sync photos and videos onto your iPhone using iTunes, or add photos and videos from other albums and events.";
"EMPTY_ALBUM_CAMERA_NOT_AVAILABLE_iPad Simulator" = "You can sync photos and videos onto your iPad using iTunes, or add photos and videos from other albums and events.";

/* Message for empty photo album when a camera is available */
"EMPTY_ALBUM_CAMERA_AVAILABLE_iPhone" = "You can take photos using the camera, sync photos and videos onto your iPhone using iTunes, or add photos and videos from other albums and events.";
"EMPTY_ALBUM_CAMERA_AVAILABLE_iPod touch" = "You can take photos using the camera, sync photos and videos onto your iPod using iTunes, or add photos and videos from other albums and events.";
"EMPTY_ALBUM_CAMERA_AVAILABLE_iPad" = "You can take photos using the camera, sync photos and videos onto your iPad using iTunes, or add photos and videos from other albums and events.";
"EMPTY_ALBUM_CAMERA_AVAILABLE_iPhone Simulator" = "You can take photos using the camera, sync photos and videos onto your iPhone using iTunes, or add photos and videos from other albums and events.";
"EMPTY_ALBUM_CAMERA_AVAILABLE_iPad Simulator" = "You can take photos using the camera, sync photos and videos onto your iPad using iTunes, or add photos and videos from other albums and events.";

/* Message for empty photo album when a video is available */
"EMPTY_ALBUM_VIDEO_AVAILABLE_iPhone" = "You can take photos and videos using the camera, sync photos and videos onto your iPhone using iTunes, or add photos and videos from other albums and events.";
"EMPTY_ALBUM_VIDEO_AVAILABLE_iPod touch" = "You can take photos and videos using the camera, sync photos and videos onto your iPod using iTunes, or add photos and videos from other albums and events.";
"EMPTY_ALBUM_VIDEO_AVAILABLE_iPad" = "You can take photos and videos using the camera, sync photos and videos onto your iPad using iTunes, or add photos and videos from other albums and events.";
"EMPTY_ALBUM_VIDEO_AVAILABLE_iPhone Simulator" = "You can take photos and videos using the camera, sync photos and videos onto your iPhone using iTunes, or add photos and videos from other albums and events.";
"EMPTY_ALBUM_VIDEO_AVAILABLE_iPad Simulator" = "You can take photos and videos using the camera, sync photos and videos onto your iPad using iTunes, or add photos and videos from other albums and events.";

/* Message for empty photo stream album */
"EMPTY_ALBUM_PHOTO_STREAM" = "Photo Stream uploads and stores the last thirty days of your photos on iCloud, and downloads them to all your devices.";

/* Message for empty photo album when there is no content in the library */
"EMPTY_ALBUM_EMPTY_LIBRARY_CAMERA_NOT_AVAILABLE_iPhone" = "You can sync photos and videos onto your iPhone using iTunes.";
"EMPTY_ALBUM_EMPTY_LIBRARY_CAMERA_NOT_AVAILABLE_iPod touch" = "You can sync photos and videos onto your iPod using iTunes.";
"EMPTY_ALBUM_EMPTY_LIBRARY_CAMERA_NOT_AVAILABLE_iPad" = "You can sync photos and videos onto your iPad using iTunes.";
"EMPTY_ALBUM_EMPTY_LIBRARY_CAMERA_NOT_AVAILABLE_iPhone Simulator" = "You can sync photos and videos onto your iPhone using iTunes.";
"EMPTY_ALBUM_EMPTY_LIBRARY_CAMERA_NOT_AVAILABLE_iPad Simulator" = "You can sync photos and videos onto your iPad using iTunes.";

/* Message for empty photo album when a camera is available and there is no content in the library */
"EMPTY_ALBUM_EMPTY_LIBRARY_CAMERA_AVAILABLE_iPhone" = "You can take photos using the camera, or sync photos and videos onto your iPhone using iTunes.";
"EMPTY_ALBUM_EMPTY_LIBRARY_CAMERA_AVAILABLE_iPod touch" = "You can take photos using the camera, or sync photos and videos onto your iPod using iTunes.";
"EMPTY_ALBUM_EMPTY_LIBRARY_CAMERA_AVAILABLE_iPad" = "You can take photos using the camera, or sync photos and videos onto your iPad using iTunes.";
"EMPTY_ALBUM_EMPTY_LIBRARY_CAMERA_AVAILABLE_iPhone Simulator" = "You can take photos using the camera, or sync photos and videos onto your iPhone using iTunes.";
"EMPTY_ALBUM_EMPTY_LIBRARY_CAMERA_AVAILABLE_iPad Simulator" = "You can take photos using the camera, or sync photos and videos onto your iPad using iTunes.";

/* Message for empty photo album when a video is available and there is no content in the library */
"EMPTY_ALBUM_EMPTY_LIBRARY_VIDEO_AVAILABLE_iPhone" = "You can take photos and videos using the camera, or sync photos and videos onto your iPhone using iTunes.";
"EMPTY_ALBUM_EMPTY_LIBRARY_VIDEO_AVAILABLE_iPod touch" = "You can take photos and videos using the camera, or sync photos and videos onto your iPod using iTunes.";
"EMPTY_ALBUM_EMPTY_LIBRARY_VIDEO_AVAILABLE_iPad" = "You can take photos and videos using the camera, or sync photos and videos onto your iPad using iTunes.";
"EMPTY_ALBUM_EMPTY_LIBRARY_VIDEO_AVAILABLE_iPhone Simulator" = "You can take photos and videos using the camera, or sync photos and videos onto your iPhone using iTunes.";
"EMPTY_ALBUM_EMPTY_LIBRARY_VIDEO_AVAILABLE_iPad Simulator" = "You can take photos and videos using the camera, or sync photos and videos onto your iPad using iTunes.";

/* Message when there's not enough disk space */
"LOW_DISK_SPACE_TITLE" = "Low Disk Space";
"LOW_DISK_SPACE_PHOTO_TITLE" = "Cannot Take Photo";
"LOW_DISK_SPACE_VIDEO_TITLE" = "Cannot Record Video";
"LOW_DISK_SPACE_TRIM_TITLE" = "Cannot Trim Video";
"LOW_DISK_SPACE_PHOTO_BODY" = "There is not enough available storage to take a photo. You can manage your storage in Settings.";
"LOW_DISK_SPACE_VIDEO_BODY" = "There is not enough available storage to record video. You can manage your storage in Settings.";
"LOW_DISK_SPACE_TRIM_BODY" = "There is not enough available storage to trim video. You can manage your storage in Settings.";
"LOW_DISK_SPACE_NO_SETTINGS_PHOTO_BODY" = "There is not enough available storage to take a photo.";
"LOW_DISK_SPACE_NO_SETTINGS_VIDEO_BODY" = "There is not enough available storage to record video.";
"LOW_DISK_SPACE_NO_SETTINGS_TRIM_BODY" = "There is not enough available storage to trim video.";
"LOW_DISK_SPACE_ALERT_SETTINGS_TITLE" = "Settings";
"LOW_DISK_SPACE_ALERT_DONE_TITLE" = "Done";
"LOW_DISK_SPACE_NO_SETTINGS_ALERT_DONE_TITLE" = "OK";

/* Recording stopped resons */
"RECORDING_STOPPED_TITLE" = "Video Recording Stopped";
"MAX_RECORDING_DURATION_REACHED"  = "The maximum length for this video has been reached.";
"MAX_RECORDING_FILE_SIZE_REACHED" = "The maximum size for this video has been reached."; 

"MOBILE_ME_SERVICE_NAME" = "MobileMe";

/* Crop overlay title */
"TAKE_PICTURE" = "Take Picture";

// ***

"FLASH_DISABLED_TITLE"    = "Flash is Disabled";
"FLASH_DISABLED_MESSAGE_iPhone"  = "The iPhone needs to cool down before you can use the flash.";
"FLASH_DISABLED_MESSAGE_iPod touch" = "The iPod needs to cool down before you can use the flash.";
"FLASH_DISABLED_MESSAGE_iPad"  = "The iPad needs to cool down before you can use the flash.";

"VIDEO_INCOMPATIBLE_ERROR" = "Operation failed because this video is incompatible with this device's saved photos roll.";

/* Titles for segments for camera album sheet */
"CAMERA_ALBUM_SEGMENT_ALL" = "All";
"CAMERA_ALBUM_SEGMENT_PHOTOS" = "Photos";
"CAMERA_ALBUM_SEGMENT_VIDEO" = "Videos";

"TRIM_ACTION_TITLE" = "Trim";

"TRIM_BUTTON_TITLE" = "Trim";
"PUBLISH_BUTTON_TITLE" = "Publish";

"APPROXIMATE_SIZE" = "(≈%@)";

"MEDIA_PROGRESS_NO_TIME_FORMAT" = "Publishing to %@";
"MEDIA_PROGRESS_FORMAT" = "Publishing to %@: %@";
"MEDIA_TIME_MINUTES_REMAINING_FORMAT" = "About %d Minutes Remaining…";
"MEDIA_TIME_ONE_MINUTE_REMAINING" = "About 1 Minute Remaining…";
"MEDIA_TIME_SECONDS_REMAINING_FORMAT" = "About %d Seconds Remaining…";
"MEDIA_TIME_ONE_SECOND_REMAINING" = "About 1 Second Remaining…";
"COMPLETING_UPLOAD" = "Completing Upload…";

TRIMMING_VIDEO      = "Trimming Video…";
PREPARING_VIDEO     = "Preparing Video…";
COMPRESSING_VIDEO   = "Compressing Video…";

//Generic formats are used for media with no Title. Eg: Photo Published

PUBLISHED_MEDIA_FORMAT  = "“%@” Published";
PUBLISHED_VIDEO         = "Video Published";
PUBLISHED_IMAGE         = "Photo Published";

MEDIA_FAILURE_FORMAT    = "Could not publish “%@”";
FAILED_PUBLISH_VIDEO    = "Could not publish video.";
FAILED_PUBLISH_IMAGE    = "Could not publish photo.";

"VIEW_BUTTON_TITLE_FORMAT" = "View on %@";
"TELL_A_FRIEND" = "Tell a Friend";
"CLOSE" = "Close";

"TRIM_FOR_MMS_TITLE" = "Send";
"TRIM_FOR_EMAIL_TITLE" = "Email";
"TRIM_FOR_PUBLISH_TITLE" = "Publish";

"TRIM_VIDEO_NAV_TITLE" = "Trim Video";
"TRIM_VIDEO_NAV_TITLE_IMAGE_PICKER" = "Edit Video";
"TRIM_TITLE_IMAGE_PICKER" = "Save";

"VIDEO_TOO_LONG_ALERT_TITLE" = "Video is Too Long";
"VIDEO_TOO_LONG_MMS_BODY" = "Would you like to select a smaller clip from this video to send?";
"VIDEO_TOO_LONG_EMAIL_BODY" = "Would you like to select a smaller clip from this video to email?";
"VIDEO_TOO_LONG_PUBLISH_BODY" = "Would you like to select a smaller clip from this video to publish?";

"VIDEO_TOO_LONG_CANCEL" = "Cancel";
"VIDEO_TOO_LONG_OK" = "OK";

/*** Album View Button Labels  ***/
// These labels are displayed in the toolbar at the bottom of the album view after the Action icon is touched (iPhone) or in the nav bar after the action button is touched (iPad)

ADD_BUTTON          = "Add";
ADD_PHOTOS_BUTTON   = "Add Photos";
ADD_TO_BUTTON       = "Add To";
ADD_TO_ELLIPSIS_BUTTON = "Add To…";
SHARE_BUTTON        = "Share";
SHARE_BUTTON_FORMAT = "Share (%d)";
EMAIL_BUTTON        = "Email";
EMAIL_BUTTON_FORMAT = "Email (%d)";
COPY_BUTTON         = "Copy";
COPY_BUTTON_FORMAT  = "Copy (%d)";
MOVE_BUTTON         = "Add To";
MOVE_BUTTON_FORMAT  = "Add To (%d)";
PRINT_BUTTON        = "Print";
PRINT_BUTTON_FORMAT = "Print (%d)";
REMOVE_BUTTON       = "Remove";
REMOVE_BUTTON_FORMAT = "Remove (%d)";
DELETE_BUTTON       = "Delete";
DELETE_BUTTON_FORMAT = "Delete (%d)";
SAVE_TO_CAMERAROLL_BUTTON = "Save";
SAVE_TO_CAMERAROLL_SHEET_BUTTON = "Save to Camera Roll";
SAVE_TO_SAVEDPHOTOS_SHEET_BUTTON = "Save to Saved Photos";

/***/

"TRIM_ALERT_TITLE" = "Trim Original";
"TRIM_COPY_ALERT_TITLE" = "Save as New Clip";

/* Error message displayed in an alert when the re encoding of a video is interrupted */
"SHARING_WAS_INTERRUPTED" = "Sharing was interrupted";

/* Photo filename for emailed items */
"PHOTO_FILENAME" = "photo";
"AUDIO_FILENAME" = "audio";

"PRINT_FILENAME" = "Photo";

"VIDEO_TOO_LONG_TITLE" = "Video Too Long to Send";
"VIDEO_TOO_LONG_TITLE_IMAGE_PICKER" = "Video is Too Long";
"VIDEO_TOO_LONG_BODY" = "Please select a smaller clip from this video.";

"VIDEO_PLAYBACK_FAILED" = "This movie format is not supported.";

/*** Bulk Editing ***/

// Navigation bar titles.

SELECT_PHOTOS       = "Select Photos";
SELECT_VIDEOS       = "Select Videos";
SELECT_AUDIOS       = "Select Audio Files";
SELECT_ITEMS        = "Select Items";

SELECTED_PHOTO      = "1 Photo Selected";
SELECTED_PHOTOS     = "%d Photos Selected";

SELECTED_VIDEO      = "1 Video Selected";
SELECTED_VIDEOS     = "%d Videos Selected";

SELECTED_AUDIO      = "1 Audio File Selected";
SELECTED_AUDIOS     = "%d Audio Files Selected";

SELECTED_ITEM       = "1 Item Selected";
SELECTED_ITEMS      = "%d Items Selected";

// Move Action sheet labels

MOVE_TO_EXISTING_ALBUM = "Move to Existing Album";
ADD_TO_EXISTING_ALBUM  = "Add to Existing Album";
ADD_TO_NEW_ALBUM       = "Add to New Album";

// Remove confirmation button labels and prompts.

REMOVE_FROM_ALBUM_BUTTON   = "Remove from Album";

REMOVE_CONF_TITLE_PHOTO    = "This photo will be removed from this album, but will remain in your Photo Library.";
REMOVE_CONF_TITLE_PHOTOS   = "These photos will be removed from this album, but will remain in your Photo Library.";

REMOVE_CONF_TITLE_VIDEO    = "This video will be removed from this album, but will remain in your Photo Library.";
REMOVE_CONF_TITLE_VIDEOS   = "These videos will be removed from this album, but will remain in your Photo Library.";

REMOVE_CONF_TITLE_AUDIO    = "This audio clip will be removed from this album, but will remain in your Photo Library.";
REMOVE_CONF_TITLE_AUDIOS   = "These audio clips will be removed from this album, but will remain in your Photo Library.";

REMOVE_CONF_TITLE_ITEM     = "This item will be removed from this album, but will remain in your Photo Library.";
REMOVE_CONF_TITLE_ITEMS    = "These items will be removed from this album, but will remain in your Photo Library.";

REMOVE_ALL                 = "Remove All";
REMOVE_ALL_INCLUDING_ALBUM = "Remove All";


// Delete confirmation button labels.

DELETE_PHOTO        = "Delete Photo";
DELETE_PHOTOS       = "Delete Selected Photos";

DELETE_VIDEO        = "Delete Video";
DELETE_VIDEOS       = "Delete Selected Videos";

DELETE_AUDIO        = "Delete Audio";
DELETE_AUDIOS       = "Delete Selected Audio Files";

DELETE_ITEM         = "Delete Item";
DELETE_ITEMS        = "Delete Selected Items";

DELETE_MEDIA        = "Delete Media";
DELETE_MEDIAS       = "Delete Selected Media";

DELETE_ALL          = "Delete All";
DELETE_ALL_INCLUDING_ALBUM = "Delete All";
    // Displayed when an album or event will be deleted in addition to deleting all the photos within the album or event.

DELETE_CONF_TITLE   = "Only items directly imported to iPad can be deleted.";

// Deleting photos that are referenced from albums
DELETE_EVERYWHERE                               = "Delete Everywhere";

DELETE_EVERYWHERE_CONF_TITLE_PHOTO_1_ALBUM      = "This photo is used in an album.\nDo you want to delete it everywhere?";
DELETE_EVERYWHERE_CONF_TITLE_PHOTO_N_ALBUMS     = "This photo is used in %@ albums.\nDo you want to delete it everywhere?";
DELETE_EVERYWHERE_CONF_TITLE_PHOTOS_1_ALBUM     = "These photos are used in an album.\nDo you want to delete them everywhere?";
DELETE_EVERYWHERE_CONF_TITLE_PHOTOS_N_ALBUMS    = "These photos are used in %@ albums.\nDo you want to delete them everywhere?";

DELETE_EVERYWHERE_CONF_TITLE_VIDEO_1_ALBUM      = "This video is used in an album.\nDo you want to delete it everywhere?";
DELETE_EVERYWHERE_CONF_TITLE_VIDEO_N_ALBUMS     = "This video is used in %@ albums.\nDo you want to delete it everywhere?";
DELETE_EVERYWHERE_CONF_TITLE_VIDEOS_1_ALBUM     = "These videos are used in an album.\nDo you want to delete them everywhere?";
DELETE_EVERYWHERE_CONF_TITLE_VIDEOS_N_ALBUMS    = "These videos are used in %@ albums.\nDo you want to delete them everywhere?";

DELETE_EVERYWHERE_CONF_TITLE_AUDIO_1_ALBUM      = "This audio clip is used in an album.\nDo you want to delete it everywhere?";
DELETE_EVERYWHERE_CONF_TITLE_AUDIO_N_ALBUMS     = "This audio clip is used in %@ albums.\nDo you want to delete it everywhere?";
DELETE_EVERYWHERE_CONF_TITLE_AUDIOS_1_ALBUM     = "These audio clips are used in an album.\nDo you want to delete them everywhere?";
DELETE_EVERYWHERE_CONF_TITLE_AUDIOS_N_ALBUMS    = "These audio clips are used in %@ albums.\nDo you want to delete them everywhere?";

DELETE_EVERYWHERE_CONF_TITLE_ITEM_1_ALBUM       = "This item is used in an album.\nDo you want to delete it everywhere?";
DELETE_EVERYWHERE_CONF_TITLE_ITEM_N_ALBUMS      = "This item is used in %@ albums.\nDo you want to delete it everywhere?";
DELETE_EVERYWHERE_CONF_TITLE_ITEMS_1_ALBUM      = "These items are used in an album.\nDo you want to delete them everywhere?";
DELETE_EVERYWHERE_CONF_TITLE_ITEMS_N_ALBUMS     = "These items are used in %@ albums.\nDo you want to delete them everywhere?";

/*** Import ***/

// Navigation bar button labels.

IMPORT              = "Import";
IMPORT_ALL          = "Import All";
IMPORT_SELECTED     = "Import Selected";

DELETE_SELECTED     = "Delete Selected";

STOP_IMPORT         = "Stop Import";

// ***

"FREE_SPACE_TITLE" = "Not Enough Space Available";
"FREE_SPACE_MESSAGE" = "Importing requires %@ more space. Select fewer items or make more space available by removing videos, photos or songs.";

"NO_SPACE_MESSAGE_iPhone" = "This iPhone does not have enough free space to import any photos.";
"NO_SPACE_MESSAGE_iPod" = "This iPod does not have enough free space to import any photos.";
"NO_SPACE_MESSAGE_iPad" = "This iPad does not have enough free space to import any photos.";

"IMPORT_COMPLETE_TITLE" = "Import Complete";
"IMPORT_STOPPED_TITLE" = "Import Stopped";

"KEEPORDELETE_PHOTO_iPhone" = "Would you like to delete the imported photo from the attached iPhone?";
"KEEPORDELETE_PHOTOS_iPhone" = "Would you like to delete imported photos from the attached iPhone?";
"KEEPORDELETE_VIDEO_iPhone" = "Would you like to delete the imported video from the attached iPhone?";
"KEEPORDELETE_VIDEOS_iPhone" = "Would you like to delete imported videos from the attached iPhone?";
"KEEPORDELETE_MEDIA_iPhone" = "Would you like to delete imported media from the attached iPhone?";

"KEEPORDELETE_PHOTO_iPod" = "Would you like to delete the imported photo from the attached iPod?";
"KEEPORDELETE_PHOTOS_iPod" = "Would you like to delete imported photos from the attached iPod?";
"KEEPORDELETE_VIDEO_iPod" = "Would you like to delete the imported video from the attached iPod?";
"KEEPORDELETE_VIDEOS_iPod" = "Would you like to delete imported videos from the attached iPod?";
"KEEPORDELETE_MEDIA_iPod" = "Would you like to delete imported media from the attached iPod?";

"KEEPORDELETE_PHOTO_iPad" = "Would you like to delete the imported photo from the attached iPad?";
"KEEPORDELETE_PHOTOS_iPad" = "Would you like to delete imported photos from the attached iPad?";
"KEEPORDELETE_VIDEO_iPad" = "Would you like to delete the imported video from the attached iPad?";
"KEEPORDELETE_VIDEOS_iPad" = "Would you like to delete imported videos from the attached iPad?";
"KEEPORDELETE_MEDIA_iPad" = "Would you like to delete imported media from the attached iPad?";

"KEEPORDELETE_PHOTO_Camera" = "Would you like to delete the imported photo from the attached camera?";
"KEEPORDELETE_PHOTOS_Camera" = "Would you like to delete imported photos from the attached camera?";
"KEEPORDELETE_VIDEO_Camera" = "Would you like to delete the imported video from the attached camera?";
"KEEPORDELETE_VIDEOS_Camera" = "Would you like to delete imported videos from the attached camera?";
"KEEPORDELETE_MEDIA_Camera" = "Would you like to delete imported media from the attached camera?";

"KEEPORDELETE_PHOTO_FORMAT" = "Would you like to delete the imported photo from '%@'?";
"KEEPORDELETE_PHOTOS_FORMAT" = "Would you like to delete imported photos from '%@'?";
"KEEPORDELETE_VIDEO_FORMAT" = "Would you like to delete the imported video from '%@'?";
"KEEPORDELETE_VIDEOS_FORMAT" = "Would you like to delete imported videos from '%@'?";
"KEEPORDELETE_MEDIA_FORMAT" = "Would you like to delete imported media from '%@'?";

"KEEP" = "Keep";
"REMOVE" = "Delete";
"IGNORE_DUPLICATES" = "Skip Duplicates";
"IMPORT_DUPS" = "Duplicate Photos";
"IMPORT_DUPS_MSG" = "Some of these photos already exist in your Photo Library.";
"IMPORT_DUPS_ALL_MSG" = "All these photos already exist in your Photo Library.";
"UNLOCK_DEVICE_iPhone" = "Unlock iPhone to import photos";
"UNLOCK_DEVICE_iPod" = "Unlock iPod to import photos";
"UNLOCK_DEVICE_iPad" = "Unlock iPad to import photos";

"IMPORT_MULTI_ALERT_TITLE" = "Multiple formats imported";
"IMPORT_MULTI_ALERT_MESSAGE" = "Photo Stream will upload only one version of each of these items.";

// Shorter form of "Import All" for the confirmation dialog
IMPORT_ALL_SHORT          = "Import All";

"CAMERA_DEVICE_TYPE" = "Camera";

"IMPORT_LOADING_STRING" = "Loading…";

"IMPORT_EMPTY_DEVICE_TITLE" = "No photos to import";
"IMPORT_EMPTY_DEVICE_MESSAGE" = "";

/* Error string for when an image from an external camera fails to download */
"CAMERA_IMPORT_DOWNLOAD_FAILED" = "Failed to download photo.";

/* Error string for when an image from an external camera fails to import */
"CAMERA_IMPORT_IMPORT_FAILED" = "Failed to import photo.";

/* Wildcat PLUIImageViewController */
"CHOOSE_PHOTO_TITLE" = "Choose Photo";
"CHOOSE_VIDEO_TITLE" = "Choose Video";
"USE_PHOTO_BUTTON_TITLE" = "Use";


"PROGRESS_SYNCING_X_OF_Y" = "Syncing %@ of %@";
"PROGRESS_IMPORTING_X_OF_Y" = "Restoring %@ of %@";
"PROGRESS_DOWNLOADING_X_OF_Y" = "Downloading %@ of %@";
"PROGRESS_SYNCING_AND_IMPORTING_X_OF_Y" = "Syncing %@ of %@";
"PROGRESS_SYNCING_AND_DOWNLOADING_X_OF_Y" = "Syncing %@ of %@";
"PROGRESS_IMPORTING_AND_DOWNLOADING_X_OF_Y" = "Downloading %@ of %@";
"PROGRESS_ALL_X_OF_Y" = "Syncing %@ of %@";


/*** Full Screen ***/

// Navigation bar button labels.

SLIDESHOW = "Slideshow";

/*** Slideshow Settings ***/

"SLIDESHOW_SETTINGS_TITLE" = "Slideshow Options";
"TRANSITIONS" = "Transitions";
"PLAY_MUSIC" = "Play Music";
"SELECTED_MUSIC" = "Music";
"NO_MUSIC_SELECTED" = "None";
"START_SLIDESHOW" = "Start Slideshow";

/* Slideshow Transitions */
"TRANSITION" = "Transition";
"CUBE" = "Cube";
"DISSOLVE" = "Dissolve";
"RIPPLE" = "Ripple";
"WIPE" = "Wipe";
"ORIGAMI" = "Origami";
"WIPEACROSS" = "Wipe Across";
"WIPEDOWN" = "Wipe Down";

/* K66 Transitions as of Durango */
"KenBurns" = "Ken Burns";
"Origami" = "Origami";
"Reflections" = "Reflections";
"Vintage Prints" = "Vintage Prints";
"Snapshots" = "Snapshots";
"PhotoMobile" = "Photo Mobile";
"HolidayMobile" = "Holiday Mobile";
"Shatter" = "Shatter";
"Places" = "Places";
"Classic" = "Classic";
"Scrapbook" = "Scrapbook";
"SlidingPanels" = "Sliding Panels";

/* Flash settings */
"FLASH_AUTO" = "Auto";
"FLASH_OFF" = "Off";
"FLASH_ON" = "On";
"FLASH_HDR" = "HDR";

"HDR_ON" = "HDR On";
"HDR_OFF" = "HDR Off";

/* Places */
"PLACES" = "Places";
"PHOTOS_SINGULAR" = "One photo";
"PHOTOS_PLURAL"   = "%@ photos";

/* New Wallpaper */
"SET_LOCK_SCREEN" = "Set Lock Screen";
"SET_HOME_SCREEN" = "Set Home Screen";
"SET_BOTH" = "Set Both";

/* Message when publish albums are loading */
"LOADING_ALBUMS" = "Loading…";

/* The name of places albums depends on their content */
"PLACE_ALBUM_TITLE_ONLY_PHOTOS_SINGULAR" = "One Photo";
"PLACE_ALBUM_TITLE_ONLY_PHOTOS_PLURAL"   = "%@ Photos";
"PLACE_ALBUM_TITLE_ONLY_VIDEOS_SINGULAR" = "One Video";
"PLACE_ALBUM_TITLE_ONLY_VIDEOS_PLURAL"   = "%@ Videos";
"PLACE_ALBUM_TITLE_PHOTOS_AND_VIDEOS"    = "%@ Items";

/* Strings used for displaying the HDR alert */
"HDR_ALERT_TITLE" = "HDR Settings";
"HDR_ALERT_MESSAGE" = "Both the original and HDR versions of each photo will be saved. You can change this in Settings.";
"HDR_ALERT_SETTINGS_BUTTON_TITLE" = "Settings";
"HDR_ALERT_DISMISS_BUTTON_TITLE" = "Dismiss";

/* HDR HUD */
"SAVING_HDR" = "Saving HDR";

/* Camera Options */
"OPTIONS_BUTTON_TITLE" = "Options";
"OPTIONS_DONE_BUTTON_TITLE" = "Done";
"GRID_OPTION" = "Grid";
"HDR_OPTION" = "HDR";

/* Camera AE/AF Lock */
"AEAF_LOCK_TEXT" = "AE/AF Lock";
"AE_LOCK_TEXT" = "AE Lock";
"AF_LOCK_TEXT" = "AF Lock";

/* Title for AirTunes Popover */
"AIR_PLAY" = "AirPlay";
"AIRTUNES_PASSWORD_ALERT_TITLE" = "AirPlay Password";
"AIRTUNES_PASSWORD_ALERT_MESSAGE_FORMAT" = "Enter the password for “%@”";
"PASSWORD_ALERT_PLACEHOLDER" = "Password";

/*Message for view on device when slideshow is playing on airtunes*/
"AIR_PLAY_SLIDESHOW_MESSAGE_FORMAT" = "This slideshow is now playing on “%@”.";
"AIR_PLAY_MOVIE_MESSAGE_FORMAT" = "This film is now playing on “%@”.";
